    //Простые функции
//1. Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.

// function sqr ($a) {
//   return  $a*$a;
// }

//2.  Сделайте функцию, которая возвращает сумму двух чисел. 

// function summ (a,b) {
//   return  a+b;
// }


//3. Сделайте функцию, которая отнимает от первого числа второе и делит на третье.

// function func (a,b,c) {
//   return  (a-b)/c;
// }

//4. Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.

// function func (a) {
//     var arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
//     return  arr[a-1];
// }
