    //Работа с concat
//1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе. 

// var a =[1,2,3];
// var b = [4,5,6];

// var c = a.concat(b);
// alert(c);

    //Работа с reverse
//2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// var a =[1,2,3];
// var b = a.reverse();
// alert(b);

    //Работа с push, unshift
//3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

// var a =[1,2,3];
// a.push(4,5,6);
// alert(a);

//4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6. 

// var a =[1,2,3];
// a.unshift(4,5,6);
// alert(a);

    //Работа с shift, pop
//5. Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

// var a= ['js', 'css', 'jq'];
// alert(a.shift());

//6. Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент. 

// var a= ['js', 'css', 'jq'];
// alert(a.pop());

    //Работа с slice
//7. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].

// var a = [1, 2, 3, 4, 5];
// var b = a.slice(0,3);
// alert(b);

//8.  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].

// var a = [1, 2, 3, 4, 5];
// var b = a.slice(3);
// alert(b);

    //Работа с splice
//9. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5]. 

// var a = [1, 2, 3, 4, 5];
// a.splice(1,2);
// alert(a);

//10. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].

// var a = [1, 2, 3, 4, 5];
// var b = a.splice(1,3);
// alert(b);

//11. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5]. 

// var a = [1, 2, 3, 4, 5];
// a.splice(3, 0, 'a', 'b', 'c',);
// alert(a);

//12. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// var a = [1, 2, 3, 4, 5];
// a.splice(1, 0, 'a', 'b');
// a.splice(6, 0, 'c');
// a.splice(8, 0, 'e');

// alert(a);

    //Работа с sort
//13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его. 

// var a =[3, 4, 1, 2, 7];
// alert(a.sort());

    //Работа с Object.keys
//14. Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив его ключей.

// var obj = {js:'test', jq: 'hello', css: 'world'};
// alert(Object.keys(obj));
