    //На цикл в цикле
//1. Выведите на экран таблицу умножения (как в школьной тетради).

// for(i=1;i<=10;i++){
//     for(j=1;j<=10;j++){
//         document.write(String(j) + '*' + String(i) + '=' + i*j + '<br>');
//     }
//     document.write('<br>')
// }

    //Пирамидки
 //2. С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную str.

//  var str='';
//  for(i=1;i<10;i++){
//     str+=i;
//  }
//  alert(str);

//3.  С помощью цикла for сформируйте строку '987654321' и запишите ее в переменную str.

//  var str='';
//  for(i=9;i>0;i--){
//     str+=i;
//  }
//  alert(str);

//4.  С помощью цикла for сформируйте строку '-1-2-3-4-5-6-7-8-9-' и запишите ее в переменную str.

//  var str='-';
//  for(i=1;i<10;i++){
//     str+=i+'-';
//  }
//  alert(str);

//5. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:

//  for(i=1;i<=20;i++){
//     for(j=1;j<=i;j++){
//         document.write('x')
//     }
//     document.write('<br>')
//  }

//6.  С помощью двух вложенных циклов нарисуйте следующую пирамидку:

//  for(i=1;i<=9;i++){
//     for(j=1;j<=i;j++){
//         document.write(i)
//     }
//     document.write('<br>')
//  }

//7.  Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for:


//  for(i=1;i<=5;i++){
//     for(j=1;j<=i;j++){
//         document.write('xx')
//     }
//     document.write('<br>')
//  }
